Ran Plan for dir: `terraform/atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # kubernetes_secret.loki-tls has been changed
~ resource "kubernetes_secret" "loki-tls" {
      ~ data      = (sensitive value)
        id        = "default/wayofthesys-com-loki-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/alt-names"        = "wayofthesys.com"
              + "cert-manager.io/certificate-name" = "wayofthesys-com-loki-tls"
              + "cert-manager.io/common-name"      = "wayofthesys.com"
              + "cert-manager.io/ip-sans"          = ""
              + "cert-manager.io/issuer-group"     = "cert-manager.io"
              + "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              + "cert-manager.io/issuer-name"      = "zerossl"
              + "cert-manager.io/uri-sans"         = ""
            }
            name             = "wayofthesys-com-loki-tls"
          ~ resource_version = "31253978" -> "31254496"
            # (4 unchanged attributes hidden)
        }
    }
  # kubernetes_secret.tls has been changed
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/alt-names"        = "pritunl.wayofthesys.com"
              + "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls"
              + "cert-manager.io/common-name"      = "pritunl.wayofthesys.com"
              + "cert-manager.io/ip-sans"          = ""
              + "cert-manager.io/issuer-group"     = "cert-manager.io"
              + "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              + "cert-manager.io/issuer-name"      = "zerossl"
              + "cert-manager.io/uri-sans"         = ""
            }
            name             = "wayofthesys-com-pritunl-tls"
          ~ resource_version = "31253980" -> "31254524"
            # (4 unchanged attributes hidden)
        }
    }
  # kubernetes_secret.tls-vpn has been changed
~ resource "kubernetes_secret" "tls-vpn" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-vpn-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/alt-names"        = "vpn.wayofthesys.com"
              + "cert-manager.io/certificate-name" = "wayofthesys-com-vpn-tls"
              + "cert-manager.io/common-name"      = "vpn.wayofthesys.com"
              + "cert-manager.io/ip-sans"          = ""
              + "cert-manager.io/issuer-group"     = "cert-manager.io"
              + "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              + "cert-manager.io/issuer-name"      = "zerossl"
              + "cert-manager.io/uri-sans"         = ""
            }
            name             = "wayofthesys-com-vpn-tls"
          ~ resource_version = "31253979" -> "31254541"
            # (4 unchanged attributes hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # grafana_dashboard.loki-metrics will be created
+ resource "grafana_dashboard" "loki-metrics" {
      + config_json  = jsonencode(
            {
              + __inputs      = [
                  + {
                      + description = ""
                      + label       = "Loki"
                      + name        = "DS_LOKI"
                      + pluginId    = "loki"
                      + pluginName  = "Loki"
                      + type        = "datasource"
                    },
                  + {
                      + description = ""
                      + label       = "Prometheus"
                      + name        = "DS_PROMETHEUS"
                      + pluginId    = "prometheus"
                      + pluginName  = "Prometheus"
                      + type        = "datasource"
                    },
                ]
              + __requires    = [
                  + {
                      + id      = "grafana"
                      + name    = "Grafana"
                      + type    = "grafana"
                      + version = "6.7.0"
                    },
                  + {
                      + id      = "graph"
                      + name    = "Graph"
                      + type    = "panel"
                      + version = ""
                    },
                  + {
                      + id      = "logs"
                      + name    = "Logs"
                      + type    = "panel"
                      + version = ""
                    },
                  + {
                      + id      = "loki"
                      + name    = "Loki"
                      + type    = "datasource"
                      + version = "1.0.0"
                    },
                  + {
                      + id      = "prometheus"
                      + name    = "Prometheus"
                      + type    = "datasource"
                      + version = "1.0.0"
                    },
                  + {
                      + id      = "text"
                      + name    = "Text"
                      + type    = "panel"
                      + version = ""
                    },
                ]
              + annotations   = {
                  + list = [
                      + {
                          + $$hashKey  = "object:75"
                          + builtIn    = 1
                          + datasource = "-- Grafana --"
                          + enable     = true
                          + hide       = true
                          + iconColor  = "rgba(0, 211, 255, 1)"
                          + name       = "Annotations & Alerts"
                          + type       = "dashboard"
                        },
                    ]
                }
              + description   = "Loki logs panel with prometheus variables "
              + editable      = true
              + gnetId        = 12019
              + graphTooltip  = 0
              + iteration     = 1586288900167
              + links         = []
              + panels        = [
                  + {
                      + aliasColors     = {}
                      + bars            = true
                      + dashLength      = 10
                      + dashes          = false
                      + datasource      = "${DS_LOKI}"
                      + fill            = 1
                      + fillGradient    = 0
                      + gridPos         = {
                          + h = 3
                          + w = 24
                          + x = 0
                          + y = 0
                        }
                      + hiddenSeries    = false
                      + legend          = {
                          + avg     = false
                          + current = false
                          + max     = false
                          + min     = false
                          + show    = false
                          + total   = false
                          + values  = false
                        }
                      + lines           = false
                      + linewidth       = 1
                      + nullPointMode   = "null"
                      + options         = {
                          + dataLinks = []
                        }
                      + percentage      = false
                      + pointradius     = 2
                      + points          = false
                      + renderer        = "flot"
                      + seriesOverrides = []
                      + spaceLength     = 10
                      + stack           = false
                      + steppedLine     = false
                      + targets         = [
                          + {
                              + expr  = "sum(count_over_time({namespace=\"$namespace\", instance=~\"$pod\"} |~ \"$search\"[$__interval]))"
                              + refId = "A"
                            },
                        ]
                      + thresholds      = []
                      + timeFrom        = null
                      + timeRegions     = []
                      + timeShift       = null
                      + title           = ""
                      + tooltip         = {
                          + shared     = true
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type            = "graph"
                      + xaxis           = {
                          + buckets = null
                          + mode    = "time"
                          + name    = null
                          + show    = true
                          + values  = []
                        }
                      + yaxes           = [
                          + {
                              + $$hashKey = "object:168"
                              + format    = "short"
                              + label     = null
                              + logBase   = 1
                              + max       = null
                              + min       = null
                              + show      = false
                            },
                          + {
                              + $$hashKey = "object:169"
                              + format    = "short"
                              + label     = null
                              + logBase   = 1
                              + max       = null
                              + min       = null
                              + show      = false
                            },
                        ]
                      + yaxis           = {
                          + align      = false
                          + alignLevel = null
                        }
                    },
                  + {
                      + datasource    = "${DS_LOKI}"
                      + gridPos       = {
                          + h = 25
                          + w = 24
                          + x = 0
                          + y = 3
                        }
                      + maxDataPoints = ""
                      + options       = {
                          + showLabels     = false
                          + showTime       = true
                          + sortOrder      = "Descending"
                          + wrapLogMessage = true
                        }
                      + targets       = [
                          + {
                              + expr  = "{namespace=\"$namespace\", instance=~\"$pod\"} |~ \"$search\""
                              + refId = "A"
                            },
                        ]
                      + timeFrom      = null
                      + timeShift     = null
                      + title         = "Logs Panel"
                      + type          = "logs"
                    },
                  + {
                      + content     = <<-EOT
                            <div style="text-align:center"> For Grafana Loki blog example </div>
                            
                            
                        EOT
                      + datasource  = null
                      + gridPos     = {
                          + h = 3
                          + w = 24
                          + x = 0
                          + y = 28
                        }
                      + mode        = "html"
                      + timeFrom    = null
                      + timeShift   = null
                      + title       = ""
                      + transparent = true
                      + type        = "text"
                    },
                ]
              + schemaVersion = 22
              + style         = "dark"
              + tags          = []
              + templating    = {
                  + list = [
                      + {
                          + allValue       = null
                          + current        = {}
                          + datasource     = "${DS_PROMETHEUS}"
                          + definition     = "label_values(kube_pod_info, namespace)"
                          + hide           = 0
                          + includeAll     = false
                          + index          = -1
                          + label          = null
                          + multi          = false
                          + name           = "namespace"
                          + options        = []
                          + query          = "label_values(kube_pod_info, namespace)"
                          + refresh        = 1
                          + regex          = ""
                          + skipUrlSync    = false
                          + sort           = 0
                          + tagValuesQuery = ""
                          + tags           = []
                          + tagsQuery      = ""
                          + type           = "query"
                          + useTags        = false
                        },
                      + {
                          + allValue       = ".*"
                          + current        = {}
                          + datasource     = "${DS_PROMETHEUS}"
                          + definition     = "label_values(container_network_receive_bytes_total{namespace=~\"$namespace\"},pod)"
                          + hide           = 0
                          + includeAll     = true
                          + index          = -1
                          + label          = null
                          + multi          = true
                          + name           = "pod"
                          + options        = []
                          + query          = "label_values(container_network_receive_bytes_total{namespace=~\"$namespace\"},pod)"
                          + refresh        = 1
                          + regex          = ""
                          + skipUrlSync    = false
                          + sort           = 0
                          + tagValuesQuery = ""
                          + tags           = []
                          + tagsQuery      = ""
                          + type           = "query"
                          + useTags        = false
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "level=warn"
                              + value    = "level=warn"
                            }
                          + hide        = 0
                          + label       = null
                          + name        = "search"
                          + options     = [
                              + {
                                  + selected = true
                                  + text     = "level=warn"
                                  + value    = "level=warn"
                                },
                            ]
                          + query       = "level=warn"
                          + skipUrlSync = false
                          + type        = "textbox"
                        },
                    ]
                }
              + time          = {
                  + from = "now-30m"
                  + to   = "now"
                }
              + timepicker    = {
                  + refresh_intervals = [
                      + "5s",
                      + "10s",
                      + "30s",
                      + "1m",
                      + "5m",
                      + "15m",
                      + "30m",
                      + "1h",
                      + "2h",
                      + "1d",
                    ]
                }
              + timezone      = ""
              + title         = "Loki Dashboard quick search"
              + uid           = "liz0yRCZz"
              + variables     = {
                  + list = []
                }
            }
        )
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_data_source.influxdb will be destroyed
- resource "grafana_data_source" "influxdb" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "2" -> null
      - is_default         = false -> null
      - name               = "loki" -> null
      - type               = "loki" -> null
      - uid                = "fpTBgNqnk" -> null
      - url                = "http://loki:3100/" -> null
    }

  # grafana_data_source.loki will be created
+ resource "grafana_data_source" "loki" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + name               = "loki"
      + type               = "loki"
      + uid                = (known after apply)
      + url                = "http://loki:3100/"
    }

  # kubernetes_secret.loki-tls will be updated in-place
~ resource "kubernetes_secret" "loki-tls" {
      ~ data      = (sensitive value)
        id        = "default/wayofthesys-com-loki-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cert-manager.io/alt-names"        = "wayofthesys.com" -> null
              - "cert-manager.io/certificate-name" = "wayofthesys-com-loki-tls" -> null
              - "cert-manager.io/common-name"      = "wayofthesys.com" -> null
              - "cert-manager.io/ip-sans"          = "" -> null
              - "cert-manager.io/issuer-group"     = "cert-manager.io" -> null
              - "cert-manager.io/issuer-kind"      = "ClusterIssuer" -> null
              - "cert-manager.io/issuer-name"      = "zerossl" -> null
              - "cert-manager.io/uri-sans"         = "" -> null
            }
            name             = "wayofthesys-com-loki-tls"
            # (5 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.tls will be updated in-place
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cert-manager.io/alt-names"        = "pritunl.wayofthesys.com" -> null
              - "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls" -> null
              - "cert-manager.io/common-name"      = "pritunl.wayofthesys.com" -> null
              - "cert-manager.io/ip-sans"          = "" -> null
              - "cert-manager.io/issuer-group"     = "cert-manager.io" -> null
              - "cert-manager.io/issuer-kind"      = "ClusterIssuer" -> null
              - "cert-manager.io/issuer-name"      = "zerossl" -> null
              - "cert-manager.io/uri-sans"         = "" -> null
            }
            name             = "wayofthesys-com-pritunl-tls"
            # (5 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.tls-vpn will be updated in-place
~ resource "kubernetes_secret" "tls-vpn" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-vpn-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cert-manager.io/alt-names"        = "vpn.wayofthesys.com" -> null
              - "cert-manager.io/certificate-name" = "wayofthesys-com-vpn-tls" -> null
              - "cert-manager.io/common-name"      = "vpn.wayofthesys.com" -> null
              - "cert-manager.io/ip-sans"          = "" -> null
              - "cert-manager.io/issuer-group"     = "cert-manager.io" -> null
              - "cert-manager.io/issuer-kind"      = "ClusterIssuer" -> null
              - "cert-manager.io/issuer-name"      = "zerossl" -> null
              - "cert-manager.io/uri-sans"         = "" -> null
            }
            name             = "wayofthesys-com-vpn-tls"
            # (5 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 3 to change, 1 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 16, in provider "digitalocean":
  16:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Warning: Argument is deprecated

  with tls_self_signed_cert.ca-vpn,
  on tls-vpn.tf line 20, in resource "tls_self_signed_cert" "ca-vpn":
  20:   key_algorithm   = tls_private_key.ca-vpn.algorithm

This is now ignored, as the key algorithm is inferred from the
`private_key_pem`.

(and 11 more similar warnings elsewhere)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 2 to add, 3 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
